"""Нужно разработать приложение для финансового планирования.
Приложение учитывает сколько уходит на ипотеку, "на жизнь" и сколько нужно отложить на пенсию.
Пользователь вводит заработанную плату в месяц.
Сколько процентов от зп уходит на ипотеку.
Сколько процентов от зп уходит "на жизнь".
Сколько раз приходит премия в год.
Остальная часть заработанной платы откладывается на пенсию.
Также пользователю приходит премия в размере зарплаты, от которой половина уходит на отпуск, а вторая половина откладывается.
Программа должна учитывать сколько премий было в год.
Нужно вывести сколько денег тратит пользователь на ипотеку и сколько он накопит за год."""
# Ввод исходных данных
salary = int(input('Введите заработанную плату в месяц: '))
mortgage_interest = int(input('Введите сколько процентов уходит на ипотеку: '))
on_life = int(input('Введите сколько процентов уходит на жизнь: '))
number_of_awards = int(input('Введите количество премий за год: '))

# Начинаем расчеты
mortgage = int(salary * (mortgage_interest / 100) * 12) # ипотека за год
pension = (salary * 12) - mortgage - (salary * 12 * on_life / 100)  # пенсия за год
bonus = (number_of_awards * salary) # премия за год
capital = int(pension + (bonus / 2)) # накопления за год
print('Вывод:')
print(f'На ипотеку было потрачено: {mortgage} рублей')
print(f'Было накоплено: {capital} рублей')