# На лекции мы рассматривали пример для военкомата. Сейчас мы знаем мы про его рост. Расширить это приложение следующим условиями:

# Проверка на возраст призывника;
# Количество детей;
# Учится ли он сейчас.

height = int(input('Введите ваш рост: '))
age = int(input('Введите ваш возраст: '))
count_childrens = int(input('Введите сколько у вас детей: '))
student = input('Вы учитесь в институте? (да/нет)')

if count_childrens >= 2:
    print('Замитесь лучше воспитанием будующих войнов!')
elif student == 'да':
    print('Сначала отучитесь, потом - приходите.')
else:
    if age >= 18 and age < 28:
        if height < 130:
            print('В Хирд Гномов!')
        elif height < 170:
            print('В танкисты!')
        elif height < 185:
            print('На флот!')
        elif height < 200:
            print('В десантники')
        elif height < 250:
            print('В ЦСКА по баскетболу!')

    else:
        print('С вашими габаритами не место в армии')
